Tekla Open API Reference for Tekla Structures 2025
BaseWeld.StitchWeld Property
Note: This API is now obsolete.
 Gets or sets a value indicating whether the weld is stitched (true) or not stitched (false).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Use IntermittentType instead.")]
public bool StitchWeld { get; set; }
<ObsoleteAttribute("Use IntermittentType instead.")>
Public Property StitchWeld As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
BaseWeld Class
Tekla.Structures.Model Namespace